---
kind: type
id: T:Autodesk.Revit.DB.MEPSystemType
source: html/9a14b7f0-1472-4375-c4f0-86f9f2479851.htm
---
# Autodesk.Revit.DB.MEPSystemType

A system type in the Autodesk Revit MEP product.

## Syntax (C#)
```csharp
public class MEPSystemType : ElementType
```

## Remarks
This is the base class for mechanical and piping system types,
 available only in the Autodesk Revit MEP product.